In [1]:
# Importing Packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

# Loading Dataset

In [2]:
# Loading Dataset
df1 = pd.read_csv("dataset/Bengaluru_House_Data.csv")
df1.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [3]:
df1.shape

(13320, 9)

In [4]:
# Looking unique area_type
#df1['area_type'].value_counts()
df1.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [5]:
# Drop features that are not required to build our model
df2 = df1.drop(['area_type', 'availability', 'location', 'society'], axis=1)
df2.head()

        size total_sqft  bath  balcony   price
0      2 BHK       1056   2.0      1.0   39.07
1  4 Bedroom       2600   5.0      3.0  120.00
2      3 BHK       1440   2.0      3.0   62.00
3      3 BHK       1521   3.0      1.0   95.00
4      2 BHK       1200   2.0      1.0   51.00

In [6]:
df2.shape

(13320, 5)

# Data Cleaning

In [7]:
# Data Cleaning: Handling NA Values
df2.isnull().sum()

size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [8]:
# Putting NA values in balcony with median
df2['balcony'] = df2['balcony'].fillna(df2['balcony'].median())

In [9]:
df2.isnull().sum()

size          16
total_sqft     0
bath          73
balcony        0
price          0
dtype: int64

In [10]:
# Dropping rest NA rows
df3 = df2.dropna()
df3.isnull().sum()

size          0
total_sqft    0
bath          0
balcony       0
price         0
dtype: int64

In [11]:
df3.shape

(13247, 5)

In [12]:
df3.head()

        size total_sqft  bath  balcony   price
0      2 BHK       1056   2.0      1.0   39.07
1  4 Bedroom       2600   5.0      3.0  120.00
2      3 BHK       1440   2.0      3.0   62.00
3      3 BHK       1521   3.0      1.0   95.00
4      2 BHK       1200   2.0      1.0   51.00

In [13]:
# Looking size column
df3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [14]:
# 2 BHK and 2 Bedroom is same and so on
df3['bhk'] = df3['size'].apply(lambda x : int(x.split(" ")[0]))

<ipython-input-14-ee37913a7b07>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['bhk'] = df3['size'].apply(lambda x : int(x.split(" ")[0]))

In [18]:
df3.head()

        size total_sqft  bath  balcony   price  bhk
0      2 BHK       1056   2.0      1.0   39.07    2
1  4 Bedroom       2600   5.0      3.0  120.00    4
2      3 BHK       1440   2.0      3.0   62.00    3
3      3 BHK       1521   3.0      1.0   95.00    3
4      2 BHK       1200   2.0      1.0   51.00    2

In [17]:
# Having BHK value greater than 20
df3[df3['bhk'] >20]

            size total_sqft  bath  balcony  price  bhk
1718      27 BHK       8000  27.0      0.0  230.0   27
4684  43 Bedroom       2400  40.0      0.0  660.0   43

In [21]:
# Exploring total_sqft coulmn
df3['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [26]:
#Checking float values function
def check_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [30]:
#Return having float values
df3[df3['total_sqft'].apply(check_float)].head()

        size total_sqft  bath  balcony   price  bhk
0      2 BHK       1056   2.0      1.0   39.07    2
1  4 Bedroom       2600   5.0      3.0  120.00    4
2      3 BHK       1440   2.0      3.0   62.00    3
3      3 BHK       1521   3.0      1.0   95.00    3
4      2 BHK       1200   2.0      1.0   51.00    2

In [31]:
#Return false condition
df3[~df3['total_sqft'].apply(check_float)].head()

      size   total_sqft  bath  balcony    price  bhk
30   4 BHK  2100 - 2850   4.0      0.0  186.000    4
122  4 BHK  3067 - 8156   4.0      0.0  477.000    4
137  2 BHK  1042 - 1105   2.0      0.0   54.005    2
165  2 BHK  1145 - 1340   2.0      0.0   43.490    2
188  2 BHK  1015 - 1540   2.0      0.0   56.800    2